In [4]:
import numpy as np
import pandas as pd
import os

Pandas Read the Data from Different Files Extensions
----

- csv

- xlsx

- json

- sql database

- html

- parquet

- pickle

**Read the date 2 ways :**

- public url link

- local server file address path

Read csv files
---

In [9]:
import pandas as pd

pd.read_csv(r'https://www.stats.govt.nz/assets/Uploads/Business-employment-data/Business-employment-data-September-2025-quarter/Download-data/business-employment-data-september-2025-quarter-updated-19-december-2025.zip')

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,BDCQ.SEA1AA,2011.06,80078.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
1,BDCQ.SEA1AA,2011.09,78324.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
2,BDCQ.SEA1AA,2011.12,85850.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
3,BDCQ.SEA1AA,2012.03,90743.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
4,BDCQ.SEA1AA,2012.06,81780.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
25280,BDCQ.SEE3999A,2017.06,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
25281,BDCQ.SEE3999A,2017.09,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
25282,BDCQ.SEE3999A,2017.12,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
25283,BDCQ.SEE3999A,2018.03,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
25284,BDCQ.SEE3999A,2018.06,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN

Read Excel files
---

In [21]:
pd.read_excel(r'/Users/pranay/Naresh IT/Data Files/HRanalytics.xlsx')

,Attrition,Business Travel,CF_age band,CF_attrition label,Department,Education Field,emp no,Employee Number,Gender,Job Role,...,Performance Rating,Relationship Satisfaction,Standard Hours,Stock Option Level,Total Working Years,Work Life Balance,Years At Company,Years In Current Role,Years Since Last Promotion,Years With Curr Manager
0,Yes,Travel_Rarely,35 - 44,Ex-Employees,Sales,Life Sciences,STAFF-1,1,Female,Sales Executive,...,3,1,80,0,8,1,6,4,0,5
1,No,Travel_Frequently,45 - 54,Current Employees,R&D,Life Sciences,STAFF-2,2,Male,Research Scientist,...,4,4,80,1,10,3,10,7,1,7
2,Yes,Travel_Rarely,35 - 44,Ex-Employees,R&D,Other,STAFF-4,4,Male,Laboratory Technician,...,3,2,80,0,7,3,0,0,0,0
3,No,Travel_Frequently,25 - 34,Current Employees,R&D,Life Sciences,STAFF-5,5,Female,Research Scientist,...,3,3,80,0,8,3,8,7,3,0
4,No,Travel_Rarely,25 - 34,Current Employees,R&D,Medical,STAFF-7,7,Male,Laboratory Technician,...,3,4,80,1,6,3,2,2,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1465,Yes,Non-Travel,25 - 34,Ex-Employees,R&D,Technical Degree,STAFF-1905,1905,Male,Research Scientist,...,4,2,80,1,5,3,5,2,3,0
1466,Yes,Travel_Frequently,25 - 34,Ex-Employees,R&D,Life Sciences,STAFF-1868,1868,Male,Research Scientist,...,4,2,80,0,1,2,1,0,1,0
1467,Yes,Travel_Frequently,35 - 44,Ex-Employees,Sales,Other,STAFF-1667,1667,Male,Sales Executive,...,4,1,80,0,13,4,11,9,6,7
1468,Yes,Travel_Rarely,Under 25,Ex-Employees,R&D,Life Sciences,STAFF-1878,1878,Male,Research Scientist,...,4,1,80,0,1,3,1,0,0,0
1469,Yes,Travel_Rarely,Under 25,Ex-Employees,Sales,Life Sciences,STAFF-1702,1702,Male,Sales Representative,...,4,2,80,1,3,3,3,2,0,2

Read JSON files
---

In [37]:
pd.read_json(r'/Users/pranay/Naresh IT/Data Files/sample4.json',orient='index')

,0,1,2
people,"{'firstName': 'Joe', 'lastName': 'Jackson', 'g...","{'firstName': 'James', 'lastName': 'Smith', 'g...","{'firstName': 'Emily', 'lastName': 'Jones', 'g..."

In [39]:
import pandas as pd

df = pd.read_json(r'/Users/pranay/Naresh IT/Data Files/sample4.json')
df = pd.json_normalize(df['people'])
df

  firstName lastName  gender  age      number
0       Joe  Jackson    male   28  7349282382
1     James    Smith    male   32  5678568567
2     Emily    Jones  female   24   456754675

Read files from Database 
---

- by use of pyodbc

- SQLalchemy database

In [ ]:
import pandas as pd
from sqlalchemy import create_engine
dialect+driver://username:password@host:port/database

engine = create_engine("mysql+mysqlconnector://root:Ravi%40123@localhost/pyodbc")

query = "SELECT * FROM student"

df = pd.read_sql(query, engine)

print(df)

In [ ]:
import urllib.parse
urllib.parse.quote_plus("Ravi@123")

In [ ]:
import mysql.connector

connection=mysql.connector.connect(
    host='localhost',
    user='root',
    password='Ravi@123',
    database='python_db'
)

cursor=connection.cursor()
cursor.execute('select * from movie')

data=cursor.fetchall()
pd.DataFrame(data)

Read Parquet Files
----

In [120]:
pd.read_parquet(r'https://www.timestored.com/data/sample/userdata.parquet')

,registration_dttm,id,first_name,last_name,email,gender,ip_address,cc,country,birthdate,salary,title,comments
0,2016-02-03 07:55:29,1,Amanda,Jordan,ajordan0@com.com,Female,1.197.201.2,6759521864920116,Indonesia,3/8/1971,49756.53,Internal Auditor,1E+02
1,2016-02-03 17:04:03,2,Albert,Freeman,afreeman1@is.gd,Male,218.111.175.34,,Canada,1/16/1968,150280.17,Accountant IV,
2,2016-02-03 01:09:31,3,Evelyn,Morgan,emorgan2@altervista.org,Female,7.161.136.94,6767119071901597,Russia,2/1/1960,144972.51,Structural Engineer,
3,2016-02-03 00:36:21,4,Denise,Riley,driley3@gmpg.org,Female,140.35.109.83,3576031598965625,China,4/8/1997,90263.05,Senior Cost Accountant,
4,2016-02-03 05:05:31,5,Carlos,Burns,cburns4@miitbeian.gov.cn,,169.113.235.40,5602256255204850,South Africa,,NaN,,
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,2016-02-03 10:30:59,996,Dennis,Harris,dharrisrn@eepurl.com,Male,178.180.111.236,374288806662929,Greece,7/8/1965,263399.54,Editor,
996,2016-02-03 17:16:53,997,Gloria,Hamilton,ghamiltonro@rambler.ru,Female,71.50.39.137,,China,4/22/1975,83183.54,VP Product Management,
997,2016-02-03 05:02:20,998,Nancy,Morris,nmorrisrp@ask.com,,6.188.121.221,3553564071014997,Sweden,5/1/1979,NaN,Junior Executive,
998,2016-02-03 02:41:32,999,Annie,Daniels,adanielsrq@squidoo.com,Female,97.221.132.35,30424803513734,China,10/9/1991,18433.85,Editor,​
999,2016-02-03 09:52:18,1000,Julie,Meyer,jmeyerrr@flavors.me,Female,217.1.147.132,374288099198540,China,,222561.13,,

In [49]:
pd.read_parquet(r'https://www.timestored.com/data/sample/table.parquet')

   one  two  three                      four                five
a -1.0  foo   True 2022-12-23 00:00:00+00:00 2022-12-23 11:43:49
b  NaN  bar  False 2021-12-23 00:00:00+00:00 2021-12-23 12:44:50
c  2.5  baz   None 2020-12-23 00:00:00+00:00 2020-12-23 13:45:51

Read Html Files
----

In [122]:
pd.read_html(r'https://c3.nasa.gov/dashlink/static/media/other/BSCW_base.htm')

[              0                       1                   2  \
 0           NaN                 Element          Resolution
 1  Unstructured  Tets and Mixed Element  Coarse/Medium/Fine

                               3                                            4
 0            Node or Cell based                                        Links
 1  Node Based and Cell-Centered  https://c3.nasa.gov/dashlink/resources/479/  ,
             0                       1                   2                   3  \
 0         NaN                 Element          Resolution  Node or Cell based
 1  Structured  Multi-Block Structured  Coarse/Medium/Fine                 NaN

                                              4
 0                                        Links
 1  https://c3.nasa.gov/dashlink/resources/481/  ,
     0        1                   2                   3  \
 0 NaN  Element          Resolution  Node or Cell based
 1 NaN      NaN  Coarse/Medium/Fine                 NaN

                                              4
 0                                        Links
 1  https://c3.nasa.gov/dashlink/resources/521/  ,
               0              1           2                   3  \
 0           NaN        Element  Resolution  Node or Cell based
 1  Unstructured  Mixed Element        Fine                Node
 2  Unstructured  Mixed Element      Medium                Node
 3  Unstructured  Mixed Element      Coarse                Node
 4  Unstructured      Fully Tet        Fine                Node
 5  Unstructured      Fully Tet      Medium                Node
 6  Unstructured      Fully Tet      Coarse                Node

                                              4
 0                                        Links
 1  https://c3.nasa.gov/dashlink/resources/436/
 2  https://c3.nasa.gov/dashlink/resources/436/
 3  https://c3.nasa.gov/dashlink/resources/436/
 4                                          NaN
 5                                          NaN
 6                                          NaN  ,
               0                       1                   2  \
 0           NaN                 Element          Resolution
 1  Unstructured  Tets and Mixed Element  Coarse/Medium/Fine

                               3                                            4
 0            Node or Cell based                                        Links
 1  Node Based and Cell-Centered  https://c3.nasa.gov/dashlink/resources/476/  ,
                                                    0
 0  1992021508.pdf  On-line analysis capabilities ...
 1  NASA_TM104180_BMP.pdf  BMP - Description and H...
 2  AIAA-1992-2368_Dansberry.pdf  Dyn Characterist...
 3  AIAA-JA_Vol40_no1_Piatak_OTT.pdf  Oscillating ...
 4  AIAA_2002-0171_OTT.pdf  A New Forced Oscillati...
 5  NASA_TM4457_BSCW.pdf  Physical Properties of B...
 6  Schuster_splitterplateTM.pdf  BSCW Splitter Pl...]

Read Pickle Files
----

In [126]:
pd.read_pickle(r'/Users/pranay/Downloads/pickle files/mnist.pkl')

((array([[0., 0., 0., ..., 0., 0., 0.],
         [0., 0., 0., ..., 0., 0., 0.],
         [0., 0., 0., ..., 0., 0., 0.],
         ...,
         [0., 0., 0., ..., 0., 0., 0.],
         [0., 0., 0., ..., 0., 0., 0.],
         [0., 0., 0., ..., 0., 0., 0.]], dtype=float32),
  array([5, 0, 4, ..., 8, 4, 8])),
 (array([[0., 0., 0., ..., 0., 0., 0.],
         [0., 0., 0., ..., 0., 0., 0.],
         [0., 0., 0., ..., 0., 0., 0.],
         ...,
         [0., 0., 0., ..., 0., 0., 0.],
         [0., 0., 0., ..., 0., 0., 0.],
         [0., 0., 0., ..., 0., 0., 0.]], dtype=float32),
  array([3, 8, 6, ..., 5, 6, 8])),
 (array([[0., 0., 0., ..., 0., 0., 0.],
         [0., 0., 0., ..., 0., 0., 0.],
         [0., 0., 0., ..., 0., 0., 0.],
         ...,
         [0., 0., 0., ..., 0., 0., 0.],
         [0., 0., 0., ..., 0., 0., 0.],
         [0., 0., 0., ..., 0., 0., 0.]], dtype=float32),
  array([7, 2, 1, ..., 4, 5, 6])))

In [84]:
import pandas as pd
import pickle


data = {
    "info": "Sample pickle file",
    "version": 1,
    "df": pd.DataFrame({
        "name": ["Joe", "James", "Emily"],
        "age": [25, 30, 22]
    })
}


with open("sample_pickle.pkl", "wb") as f:
    pickle.dump(data, f)

print("Pickle file created successfully!")

Pickle file created successfully!

In [90]:
pd.read_pickle(r'/Users/pranay/Naresh IT/Python/Pandas By Ravi/sample_pickle.pkl')

{'info': 'Sample pickle file',
 'version': 1,
 'df':     name  age
 0    Joe   25
 1  James   30
 2  Emily   22}

In [92]:
import pickle

with open("sample_pickle.pkl", "rb") as f:
    obj = pickle.load(f)

obj

{'info': 'Sample pickle file',
 'version': 1,
 'df':     name  age
 0    Joe   25
 1  James   30
 2  Emily   22}

In [99]:
obj["df"]

    name  age
0    Joe   25
1  James   30
2  Emily   22

In [97]:
obj["info"]

'Sample pickle file'

In [62]:
import pandas as pd

df = pd.read_csv(r'https://www.stats.govt.nz/assets/Uploads/Business-employment-data/Business-employment-data-September-2025-quarter/Download-data/business-employment-data-september-2025-quarter-updated-19-december-2025.zip')

In [64]:
df

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,BDCQ.SEA1AA,2011.06,80078.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
1,BDCQ.SEA1AA,2011.09,78324.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
2,BDCQ.SEA1AA,2011.12,85850.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
3,BDCQ.SEA1AA,2012.03,90743.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
4,BDCQ.SEA1AA,2012.06,81780.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
25280,BDCQ.SEE3999A,2017.06,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
25281,BDCQ.SEE3999A,2017.09,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
25282,BDCQ.SEE3999A,2017.12,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
25283,BDCQ.SEE3999A,2018.03,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
25284,BDCQ.SEE3999A,2018.06,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN

In [66]:
df.head()

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,BDCQ.SEA1AA,2011.06,80078.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
1,BDCQ.SEA1AA,2011.09,78324.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
2,BDCQ.SEA1AA,2011.12,85850.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
3,BDCQ.SEA1AA,2012.03,90743.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
4,BDCQ.SEA1AA,2012.06,81780.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN

In [70]:
df.shape

(25285, 14)

In [72]:
df.ndim

2

In [74]:
df.dtypes

Series_reference     object
Period              float64
Data_value          float64
Suppressed           object
STATUS               object
UNITS                object
Magnitude             int64
Subject              object
Group                object
Series_title_1       object
Series_title_2       object
Series_title_3       object
Series_title_4      float64
Series_title_5      float64
dtype: object

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25285 entries, 0 to 25284
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Series_reference  25285 non-null  object
 1   Period            25285 non-null  float64
 2   Data_value        22446 non-null  float64
 3   Suppressed        2839 non-null   object
 4   STATUS            25285 non-null  object
 5   UNITS             25285 non-null  object
 6   Magnitude         25285 non-null  int64
 7   Subject           25285 non-null  object
 8   Group             25285 non-null  object
 9   Series_title_1    25285 non-null  object
 10  Series_title_2    25285 non-null  object
 11  Series_title_3    25285 non-null  object
 12  Series_title_4    0 non-null      float64
 13  Series_title_5    0 non-null      float64
dtypes: float64(4), int64(1), object(9)
memory usage: 2.7+ MB

In [103]:
status_read = df.iloc[:,:5]
status_read

      Series_reference   Period  Data_value Suppressed STATUS
0          BDCQ.SEA1AA  2011.06     80078.0        NaN      F
1          BDCQ.SEA1AA  2011.09     78324.0        NaN      F
2          BDCQ.SEA1AA  2011.12     85850.0        NaN      F
3          BDCQ.SEA1AA  2012.03     90743.0        NaN      F
4          BDCQ.SEA1AA  2012.06     81780.0        NaN      F
...                ...      ...         ...        ...    ...
25280    BDCQ.SEE3999A  2017.06         NaN          Y      F
25281    BDCQ.SEE3999A  2017.09         NaN          Y      F
25282    BDCQ.SEE3999A  2017.12         NaN          Y      F
25283    BDCQ.SEE3999A  2018.03         NaN          Y      F
25284    BDCQ.SEE3999A  2018.06         NaN          Y      F

[25285 rows x 5 columns]

In [105]:
df.isna()

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,False,False,False,True,False,False,False,False,False,False,False,False,True,True
1,False,False,False,True,False,False,False,False,False,False,False,False,True,True
2,False,False,False,True,False,False,False,False,False,False,False,False,True,True
3,False,False,False,True,False,False,False,False,False,False,False,False,True,True
4,False,False,False,True,False,False,False,False,False,False,False,False,True,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
25280,False,False,True,False,False,False,False,False,False,False,False,False,True,True
25281,False,False,True,False,False,False,False,False,False,False,False,False,True,True
25282,False,False,True,False,False,False,False,False,False,False,False,False,True,True
25283,False,False,True,False,False,False,False,False,False,False,False,False,True,True
25284,False,False,True,False,False,False,False,False,False,False,False,False,True,True

In [107]:
df.isna().sum()

Series_reference        0
Period                  0
Data_value           2839
Suppressed          22446
STATUS                  0
UNITS                   0
Magnitude               0
Subject                 0
Group                   0
Series_title_1          0
Series_title_2          0
Series_title_3          0
Series_title_4      25285
Series_title_5      25285
dtype: int64

In [109]:
df.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
25280    False
25281    False
25282    False
25283    False
25284    False
Length: 25285, dtype: bool

In [111]:
df.duplicated().sum()

0

In [113]:
df.describe()

,Period,Data_value,Magnitude,Series_title_4,Series_title_5
count,25285.000000,2.244600e+04,25285.000000,0.0,0.0
mean,2017.805680,7.372240e+04,2.263081,NaN,NaN
std,4.133456,2.134006e+05,2.908141,NaN,NaN
min,2011.060000,1.171797e+00,0.000000,NaN,NaN
25%,2014.090000,1.949373e+03,0.000000,NaN,NaN
50%,2018.030000,1.421050e+04,0.000000,NaN,NaN
75%,2021.090000,6.112550e+04,6.000000,NaN,NaN
max,2025.090000,2.321295e+06,6.000000,NaN,NaN

In [124]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-9.6.0-cp312-cp312-macosx_14_0_arm64.whl.metadata (11 kB)
Downloading mysql_connector_python-9.6.0-cp312-cp312-macosx_14_0_arm64.whl (17.6 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 17.6/17.6 MB 2.3 MB/s eta 0:00:00[36m0:00:01m eta 0:00:01
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-9.6.0